#+title: Vanilla Emacs Configuration
#+setupfile: ~/org/config/headers
#+options: auto-id:t
#+html_head: <meta name="description" content="Phundrak’s Emacs Configuration" />
#+html_head: <meta property="og:title" content="Phundrak’s Emacs Configuration" />
#+html_head: <meta property="og:description" content="Phundrak’s Emacs Configuration Detailed" />
#+property: header-args:emacs-lisp  :mkdirp yes :lexical t :exports code
#+property: header-args:emacs-lisp+ :tangle ~/.emacs.vanilla/init.el
#+property: header-args:emacs-lisp+ :mkdirp yes :noweb no-export

*** Programming Modes
:PROPERTIES:
:CUSTOM_ID: Basic-configuration-Emacs-Behavior-Programming-Modesfnmiel6184j0
:END:
First off, my definition of what makes a a “programming mode” doesn’t exactly
fit mine, so on top of ~prog-mode~, let’s add a few other modes.
#+name: line-number-modes-table
| Modes      |
|------------|
| prog-mode  |
| latex-mode |

#+name: prog-modes-gen
#+headers: :cache yes :exports none :tangle no
#+begin_src emacs-lisp :var modes=line-number-modes-table
  (mapconcat (lambda (mode) (format "%s-hook" (car mode)))
             modes
             " ")
#+end_src

#+RESULTS[b551840c279e88374f47f047e599b8d8686fd8bf]: prog-modes-gen
: prog-mode-hook latex-mode-hook

** General
:PROPERTIES:
:CUSTOM_ID: Keybinding-Management-Generalycflel6184j0
:END:
General is an awesome package for managing keybindings. Not only is it
oriented towards keychords by default (which I love), but it also
provides some integration with evil so that we can declare keybindings
for certain states only! This is a perfect replacement for ~define-key~,
~evil-define-key~, and any other function for defining keychords. And it
is also possible to declare a prefix for my keybindings! By default,
my keybinds that are not bound to a specific mode will be prefixed
with ~SPC~, but when I want to get more specific in terms of mode, I'll
prefix them with a comma (I’ve taken this habit from Spacemacs).
#+begin_src emacs-lisp
  (use-package general
    :defer t
    :straight (:build t)
    :init
    (general-auto-unbind-keys))
#+end_src

#+name: general-keybindings-gen
#+header: :tangle no :exports none :results value :cache yes
#+begin_src emacs-lisp :var table=mu4e-keybindings-view-tbl
  (mapconcat (lambda (line)
               (let* ((key      (car line))
                      (function (cadr line))
                      (function (if (or (string= "nil" function)
                                        (string= ""    function))
                                    ":ignore"
                                  function))
                      (comment  (caddr line)))
                 (format "\"%s\" %s" key
                         (if (string= "" comment)
                             (if (string= "nil" function)
                                 "nil"
                              (concat "#'" function))
                          (format "'(%s :which-key \"%s\")"
                                  function
                                  (if (string= "" function)
                                      "nil"
                                    comment))))))
             table
             "\n")
#+end_src

#+RESULTS[fa2948b693499edc6458f60c46357955b8ace1fb]: general-keybindings-gen
#+begin_example
"&" #'mu4e-view-pipe
"." '(mu4e-headers-split-adjust-width/body :which-key "mu4e-headers width")
"a" '(:ignore :which-key "attachments")
"a&" #'mu4e-view-pipe-attachment
"aa" #'mu4e-view-attachment-action
"ao" #'mu4e-view-open-attachment
"aO" #'mu4e-view-open-attachment-with
"c" '(:ignore :which-key "compose")
"cc" #'mu4e-compose-new
"ce" #'mu4e-compose-edit
"cf" #'mu4e-compose-forward
"cr" #'mu4e-compose-reply
"cR" #'mu4e-compose-resend
"g" '(:ignore :which-key "go to")
"gu" #'mu4e-view-go-to-url
"gX" #'mu4e-view-fetch-url
"l" #'mu4e-show-log
"m" '(:ignore :which-key "mark")
"md" #'mu4e-view-mark-for-trash
"mD" #'mu4e-view-mark-for-delete
"mm" #'mu4e-view-mark-for-move
"mr" #'mu4e-view-mark-for-refile
"mR" #'mu4e-view-mark-for-read
"mu" #'mu4e-view-mark-for-unread
"mU" #'mu4e-view-mark-for-unmark
"t" '(:ignore :which-key "thread")
"T" '(:ignore :which-key "toggle")
"Tc" #'mu4e-view-toggle-hide-cited
"Th" #'mu4e-view-toggle-html
"n" #'mu4e-view-headers-next
"N" #'mu4e-view-headers-next-unread
"p" #'mu4e-view-headers-prev
"P" #'mu4e-view-headers-prev-unread
#+end_example

***** Bookmarks
:PROPERTIES:
:CUSTOM_ID: Packages-Configuration-Applications-Email-Mu4e-Bookmarkszo11fl6184j0
:END:
In mu4e, the main focus isn’t really mail directories such as your
inbox, your sent messages and such, but instead you manipulate
bookmarks which will show you emails depending on tags. This mean you
can create some pretty customized bookmarks that go way beyound your
simple inbox, outbox and all. Actually, four of my bookmarks have a
couple of filtering:
- anything in my inbox linked to my university
- the [[https://emacs-doctor.com/lists/listinfo][emacs-doctor mailing list]] (French Emacs mailing list)
- the conlang mailing lists
- and my inbox for any mail not caught by any of these filters
And all of them will have the requirement not to display any trashed
email. Actually, all of my bookmarks will have this requirement,
except for the bookmark dedicated to them as well as my sent emails.
I’ll add these latter requirements later.

Here are the requirements for my university bookmark. The regex
matches any email address which contains either ~up8.edu~ or
~univ-paris8~, which can be found in email addresses from the University
Paris 8 (my university).
#+name: mu4e-bookmarks-filter-uni
#+headers: :tangle no :cache yes
#+begin_src emacs-lisp
  (string-join '("f:/.*up8\.edu|.*univ-paris8.*/"
                 "c:/.*up8\.edu|.*univ-paris8.*/"
                 "t:/.*up8\.edu|.*univ-paris8.*/")
               " OR ")
#+end_src

#+RESULTS[6f0c2005657e701b0a992061981317febcdd6200]: mu4e-bookmarks-filter-uni
: f:/.*up8.edu|.*univ-paris8.*/ OR c:/.*up8.edu|.*univ-paris8.*/ OR t:/.*up8.edu|.*univ-paris8.*/

As for the Emacs-doctor list, I need to match both the current, modern
mailing list address but also its old address.
#+name: mu4e-bookmarks-filter-emacs-list
#+headers: :tangle no :cache yes
#+begin_src emacs-lisp
  (mapconcat (lambda (address)
               (mapconcat (lambda (flag)
                            (concat flag ":" address))
                          '("list" "to" "from")
                          " OR "))
             '("ateliers-emacs.framalistes.org" "ateliers-paris.emacs-doctor.com")
             " OR ")
#+end_src

#+RESULTS[cff1b5e400cca47c06057bf236d099db01411cd7]: mu4e-bookmarks-filter-emacs-list
: list:ateliers-emacs.framalistes.org OR to:ateliers-emacs.framalistes.org OR from:ateliers-emacs.framalistes.org OR list:ateliers-paris.emacs-doctor.com OR to:ateliers-paris.emacs-doctor.com OR from:ateliers-paris.emacs-doctor.com

When it comes to the conlang mailing list, let’s not match anything
from or to them. I’ll also include the auxlang mailing list –I’m not
subscribed anymore, but it’ll keep my inbox clean.
#+name: mu4e-bookmarks-filter-conlang-list
#+headers: :tangle no :cache yes
#+begin_src emacs-lisp
  (mapconcat (lambda (address)
               (mapconcat (lambda (flag)
                            (concat flag ":" address))
                          '("from" "to" "list")
                          " OR "))
             '("CONLANG@LISTSERV.BROWN.EDU" "AUXLANG@LISTSERV.BROWN.EDU")
             " OR ")
#+end_src

#+RESULTS[129026cfdaeb910562b800b659ad8d2d13773932]: mu4e-bookmarks-filter-conlang-list
: from:CONLANG@LISTSERV.BROWN.EDU OR to:CONLANG@LISTSERV.BROWN.EDU OR list:CONLANG@LISTSERV.BROWN.EDU OR from:AUXLANG@LISTSERV.BROWN.EDU OR to:AUXLANG@LISTSERV.BROWN.EDU OR list:AUXLANG@LISTSERV.BROWN.EDU

As I said earlier, something that will often come back in my bookmarks
is the emails must not be trashed to appear. I want also to display
junk emails, so I end up with the following rule:
#+name: mu4e-bookmarks-default-filter
#+headers: :tangle no :cache yes
#+begin_src emacs-lisp
  (string-join `("NOT flag:trashed"
                 ,(format "(%s)" (mapconcat (lambda (maildir) (concat "maildir:" maildir))
                                            '("/Inbox" "/Junk")
                                            " OR ")))
               " AND ")
#+end_src

#+RESULTS[ccf162e159f77ccf87ff4fae220106f0a91ad256]: mu4e-bookmarks-default-filter
: NOT flag:trashed AND (maildir:/Inbox OR maildir:/Junk)

And for the last string-generating code, let’s describe my main inbox:
#+name: mu4e-bookmarks-inbox-filters
#+headers: :tangle no :cache yes
#+begin_src emacs-lisp
  (string-join (cons
                <<mu4e-bookmarks-default-filter>>
                `(
                  ,(format "(%s)"
                           <<mu4e-bookmarks-filter-conlang-list>>)
                  ,(format "(%s)"
                           <<mu4e-bookmarks-filter-emacs-list>>)
                  ,(format "(%s)"
                           <<mu4e-bookmarks-filter-uni>>)))
               " AND NOT ")
#+end_src

#+RESULTS[2bd917f15a55a2a509f5710c6a4db5f8a8e7a596]: mu4e-bookmarks-inbox-filters
: NOT flag:trashed AND (maildir:/Inbox OR maildir:/Junk) AND NOT (from:CONLANG@LISTSERV.BROWN.EDU OR to:CONLANG@LISTSERV.BROWN.EDU OR list:CONLANG@LISTSERV.BROWN.EDU OR from:AUXLANG@LISTSERV.BROWN.EDU OR to:AUXLANG@LISTSERV.BROWN.EDU OR list:AUXLANG@LISTSERV.BROWN.EDU) AND NOT (list:ateliers-emacs.framalistes.org OR to:ateliers-emacs.framalistes.org OR from:ateliers-emacs.framalistes.org OR list:ateliers-paris.emacs-doctor.com OR to:ateliers-paris.emacs-doctor.com OR from:ateliers-paris.emacs-doctor.com) AND NOT (f:/.*up8.edu|.*univ-paris8.*/ OR c:/.*up8.edu|.*univ-paris8.*/ OR t:/.*up8.edu|.*univ-paris8.*/)

We can finally define our bookmarks! The code reads as follows:
#+name: mu4e-bookmarks
#+begin_src emacs-lisp :tangle no :cache yes
  (setq mu4e-bookmarks
        `((:name "Inbox"
           :key ?i
           :query ,(format "%s"
                           <<mu4e-bookmarks-inbox-filters>>))
          (:name "Linguistics"
           :key ?l
           :query ,(format "%s AND %s"
                       <<mu4e-bookmarks-inbox-filters>>
                       <<mu4e-bookmarks-filter-conlang-list>>))
          (:name "Emacs"
           :key ?e
           :query ,(format "%s AND %s"
                           <<mu4e-bookmarks-inbox-filters>>
                           <<mu4e-bookmarks-filter-emacs-list>>))
          (:name "University"
           :key ?u
           :query ,(format "%s AND %s"
                           <<mu4e-bookmarks-inbox-filters>>
                           <<mu4e-bookmarks-filter-uni>>))
          (:name "eshell-info-banner"
           :key ?E
           :query ,(format "%s AND %s"
                           <<mu4e-bookmarks-inbox-filters>>
                           "list:eshell-info-banner.el.Phundrak.github.com"))
          (:name "Sent"       :key ?s :query "maildir:/Sent")
          (:name "All Unread" :key ?U :query "flag:unread AND NOT flag:trashed")
          (:name "Today"      :key ?t :query "date:today..now AND NOT flag:trashed")
          (:name "This Week"  :key ?w :query "date:7d..now    AND NOT flag:trashed")
          (:name "This Month" :key ?m :query "date:1m..now    AND NOT flag:trashed")
          (:name "This Year"  :key ?y :query "date:1y..now    AND NOT flag:trashed")))
#+end_src

#+RESULTS[4a18e1cfa32f399203b300f7cbd986a553a1b234]: mu4e-bookmarks
| :name | Inbox              | :key | 105 | :query | NOT flag:trashed AND (maildir:/Inbox OR maildir:/Junk) AND NOT (from:CONLANG@LISTSERV.BROWN.EDU OR to:CONLANG@LISTSERV.BROWN.EDU OR list:CONLANG@LISTSERV.BROWN.EDU OR from:AUXLANG@LISTSERV.BROWN.EDU OR to:AUXLANG@LISTSERV.BROWN.EDU OR list:AUXLANG@LISTSERV.BROWN.EDU) AND NOT (list:ateliers-emacs.framalistes.org OR to:ateliers-emacs.framalistes.org OR from:ateliers-emacs.framalistes.org OR list:ateliers-paris.emacs-doctor.com OR to:ateliers-paris.emacs-doctor.com OR from:ateliers-paris.emacs-doctor.com) AND NOT (f:/.*up8.edu | .*univ-paris8.*/ OR c:/.*up8.edu | .*univ-paris8.*/ OR t:/.*up8.edu | .*univ-paris8.*/)                                                                                                                                                                                                                                           |                                  |                                  |                  |
| :name | Linguistics        | :key | 108 | :query | NOT flag:trashed AND (maildir:/Inbox OR maildir:/Junk) AND NOT (from:CONLANG@LISTSERV.BROWN.EDU OR to:CONLANG@LISTSERV.BROWN.EDU OR list:CONLANG@LISTSERV.BROWN.EDU OR from:AUXLANG@LISTSERV.BROWN.EDU OR to:AUXLANG@LISTSERV.BROWN.EDU OR list:AUXLANG@LISTSERV.BROWN.EDU) AND NOT (list:ateliers-emacs.framalistes.org OR to:ateliers-emacs.framalistes.org OR from:ateliers-emacs.framalistes.org OR list:ateliers-paris.emacs-doctor.com OR to:ateliers-paris.emacs-doctor.com OR from:ateliers-paris.emacs-doctor.com) AND NOT (f:/.*up8.edu | .*univ-paris8.*/ OR c:/.*up8.edu | .*univ-paris8.*/ OR t:/.*up8.edu | .*univ-paris8.*/) AND from:CONLANG@LISTSERV.BROWN.EDU OR to:CONLANG@LISTSERV.BROWN.EDU OR list:CONLANG@LISTSERV.BROWN.EDU OR from:AUXLANG@LISTSERV.BROWN.EDU OR to:AUXLANG@LISTSERV.BROWN.EDU OR list:AUXLANG@LISTSERV.BROWN.EDU                            |                                  |                                  |                  |
| :name | Emacs              | :key | 101 | :query | NOT flag:trashed AND (maildir:/Inbox OR maildir:/Junk) AND NOT (from:CONLANG@LISTSERV.BROWN.EDU OR to:CONLANG@LISTSERV.BROWN.EDU OR list:CONLANG@LISTSERV.BROWN.EDU OR from:AUXLANG@LISTSERV.BROWN.EDU OR to:AUXLANG@LISTSERV.BROWN.EDU OR list:AUXLANG@LISTSERV.BROWN.EDU) AND NOT (list:ateliers-emacs.framalistes.org OR to:ateliers-emacs.framalistes.org OR from:ateliers-emacs.framalistes.org OR list:ateliers-paris.emacs-doctor.com OR to:ateliers-paris.emacs-doctor.com OR from:ateliers-paris.emacs-doctor.com) AND NOT (f:/.*up8.edu | .*univ-paris8.*/ OR c:/.*up8.edu | .*univ-paris8.*/ OR t:/.*up8.edu | .*univ-paris8.*/) AND list:ateliers-emacs.framalistes.org OR to:ateliers-emacs.framalistes.org OR from:ateliers-emacs.framalistes.org OR list:ateliers-paris.emacs-doctor.com OR to:ateliers-paris.emacs-doctor.com OR from:ateliers-paris.emacs-doctor.com |                                  |                                  |                  |
| :name | University         | :key | 117 | :query | NOT flag:trashed AND (maildir:/Inbox OR maildir:/Junk) AND NOT (from:CONLANG@LISTSERV.BROWN.EDU OR to:CONLANG@LISTSERV.BROWN.EDU OR list:CONLANG@LISTSERV.BROWN.EDU OR from:AUXLANG@LISTSERV.BROWN.EDU OR to:AUXLANG@LISTSERV.BROWN.EDU OR list:AUXLANG@LISTSERV.BROWN.EDU) AND NOT (list:ateliers-emacs.framalistes.org OR to:ateliers-emacs.framalistes.org OR from:ateliers-emacs.framalistes.org OR list:ateliers-paris.emacs-doctor.com OR to:ateliers-paris.emacs-doctor.com OR from:ateliers-paris.emacs-doctor.com) AND NOT (f:/.*up8.edu | .*univ-paris8.*/ OR c:/.*up8.edu | .*univ-paris8.*/ OR t:/.*up8.edu | .*univ-paris8.*/) AND f:/.*up8.edu                                                                                                                                                                                                                          | .*univ-paris8.*/ OR c:/.*up8.edu | .*univ-paris8.*/ OR t:/.*up8.edu | .*univ-paris8.*/ |
| :name | eshell-info-banner | :key |  69 | :query | NOT flag:trashed AND (maildir:/Inbox OR maildir:/Junk) AND NOT (from:CONLANG@LISTSERV.BROWN.EDU OR to:CONLANG@LISTSERV.BROWN.EDU OR list:CONLANG@LISTSERV.BROWN.EDU OR from:AUXLANG@LISTSERV.BROWN.EDU OR to:AUXLANG@LISTSERV.BROWN.EDU OR list:AUXLANG@LISTSERV.BROWN.EDU) AND NOT (list:ateliers-emacs.framalistes.org OR to:ateliers-emacs.framalistes.org OR from:ateliers-emacs.framalistes.org OR list:ateliers-paris.emacs-doctor.com OR to:ateliers-paris.emacs-doctor.com OR from:ateliers-paris.emacs-doctor.com) AND NOT (f:/.*up8.edu | .*univ-paris8.*/ OR c:/.*up8.edu | .*univ-paris8.*/ OR t:/.*up8.edu | .*univ-paris8.*/) AND list:eshell-info-banner.el.Phundrak.github.com                                                                                                                                                                                        |                                  |                                  |                  |
| :name | Sent               | :key | 115 | :query | maildir:/Sent                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                     |                                  |                                  |                                                                                                                                                                                                                                                             |                                  |                                  |                  |
| :name | All Unread         | :key |  85 | :query | flag:unread AND NOT flag:trashed                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  |                                  |                                  |                                                                                                                                                                                                                                                             |                                  |                                  |                  |
| :name | Today              | :key | 116 | :query | date:today..now AND NOT flag:trashed                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                              |                                  |                                  |                                                                                                                                                                                                                                                             |                                  |                                  |                  |
| :name | This Week          | :key | 119 | :query | date:7d..now    AND NOT flag:trashed                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                              |                                  |                                  |                                                                                                                                                                                                                                                             |                                  |                                  |                  |
| :name | This Month         | :key | 109 | :query | date:1m..now    AND NOT flag:trashed                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                              |                                  |                                  |                                                                                                                                                                                                                                                             |                                  |                                  |                  |
| :name | This Year          | :key | 121 | :query | date:1y..now    AND NOT flag:trashed                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                              |                                  |                                  |                                                                                                                                                                                                                                                             |                                  |                                  |                  |

***** Getting Fancy
:PROPERTIES:
:CUSTOM_ID: Packages-Configuration-Applications-Email-Mu4e-Getting-Fancyg731fl6184j0
:END:
I’m not a huge fan of mu4e’s default icons marking my emails, so I’ll
redefine them as follows. Be aware the name of these icons are from
/faicon/ in the package ~all-the-icons~.
#+name: mu4e-fancy-marks-tbl
| Mark      | Flag | Icon        |
|-----------+------+-------------|
| draft     | D    | pencil      |
| flagged   | F    | flag        |
| new       | N    | rss         |
| passed    | P    | check       |
| replied   | R    | reply       |
| seen      | S    | eye         |
| unread    | u    | eye-slash   |
| trashed   | T    | trash       |
| attach    | a    | paperclip   |
| encrypted | x    | lock        |
| signed    | s    | certificate |

#+name: mu4e-fancy-marks-gen
#+header: :tangle no :exports none :results value :cache yes
#+begin_src emacs-lisp :var table=mu4e-fancy-marks-tbl
  (mapconcat (lambda (line)
               (let ((mark (car line))
                     (flag (cadr line))
                     (icon (caddr line)))
                 (format "mu4e-headers-%s-mark `(\"%s\" . ,(all-the-icons-faicon \"%s\" :height 0.8))"
                         mark
                         flag
                         icon)))
             table
             "\n")
#+end_src

#+RESULTS[c6ed5d4bec4c10339a7de52a70822af74d782e62]: mu4e-fancy-marks-gen
#+begin_example
mu4e-headers-draft-mark `("D" . ,(all-the-icons-faicon "pencil" :height 0.8))
mu4e-headers-flagged-mark `("F" . ,(all-the-icons-faicon "flag" :height 0.8))
mu4e-headers-new-mark `("N" . ,(all-the-icons-faicon "rss" :height 0.8))
mu4e-headers-passed-mark `("P" . ,(all-the-icons-faicon "check" :height 0.8))
mu4e-headers-replied-mark `("R" . ,(all-the-icons-faicon "reply" :height 0.8))
mu4e-headers-seen-mark `("S" . ,(all-the-icons-faicon "eye" :height 0.8))
mu4e-headers-unread-mark `("u" . ,(all-the-icons-faicon "eye-slash" :height 0.8))
mu4e-headers-trashed-mark `("T" . ,(all-the-icons-faicon "trash" :height 0.8))
mu4e-headers-attach-mark `("a" . ,(all-the-icons-faicon "paperclip" :height 0.8))
mu4e-headers-encrypted-mark `("x" . ,(all-the-icons-faicon "lock" :height 0.8))
mu4e-headers-signed-mark `("s" . ,(all-the-icons-faicon "certificate" :height 0.8))
#+end_example

Let’s enable them and set them:
#+name: mu4e-fancy-marks
#+begin_src emacs-lisp :tangle no
  (setq mu4e-use-fancy-chars t
        <<mu4e-fancy-marks-gen()>>)
#+end_src

***** Keybindings
:PROPERTIES:
:CUSTOM_ID: Packages-Configuration-Applications-Email-Mu4e-Keybindingsh161fl6184j0
:END:
By default, Evil has some pretty annoying keybindings for users of the
bépo layout: ~hjkl~ becomes ~ctsr~ for us. Let’s undefine some of these:
#+name: mu4e-keybindings-undef
#+begin_src emacs-lisp :tangle no
  (general-define-key
   :keymaps '(mu4e-headers-mode-map mu4e-view-mode-map)
   "SPC" nil
   "s"   nil)
  (general-define-key
   :states 'normal
   :keymaps '(mu4e-headers-mode-map mu4e-view-mode-map)
   "SPC" nil
   "s"   nil
   ","   nil)
  (general-define-key
   :keymaps 'mu4e-view-mode-map
   "SPC" nil
   "S"   nil
   "r"   nil
   "c"   nil)
  (general-define-key
   :keymaps 'mu4e-view-mode-map
   :states 'normal
   "SPC" nil
   "S"   nil
   "r"   nil
   "c"   nil
   "gu"  nil)
#+end_src

#+RESULTS: mu4e-keybindings-undef

Now, let’s define some keybindings for mu4e’s view mode, that is when
we are viewing an email. All these keybindings will reside between the
major-mode specific leader key ~,~ and most of these keybindings can be
described with a simple function:
#+name: mu4e-keybindings-view-tbl
| Keybinding | Function                             | Description        |
|------------+--------------------------------------+--------------------|
| &          | mu4e-view-pipe                       |                    |
| .          | mu4e-headers-split-adjust-width/body | mu4e-headers width |
| a          | nil                                  | attachments        |
| a&         | mu4e-view-pipe-attachment            |                    |
| aa         | mu4e-view-attachment-action          |                    |
| ao         | mu4e-view-open-attachment            |                    |
| aO         | mu4e-view-open-attachment-with       |                    |
| c          | nil                                  | compose            |
| cc         | mu4e-compose-new                     |                    |
| ce         | mu4e-compose-edit                    |                    |
| cf         | mu4e-compose-forward                 |                    |
| cr         | mu4e-compose-reply                   |                    |
| cR         | mu4e-compose-resend                  |                    |
| g          | nil                                  | go to              |
| gu         | mu4e-view-go-to-url                  |                    |
| gX         | mu4e-view-fetch-url                  |                    |
| l          | mu4e-show-log                        |                    |
| m          | nil                                  | mark               |
| md         | mu4e-view-mark-for-trash             |                    |
| mD         | mu4e-view-mark-for-delete            |                    |
| mm         | mu4e-view-mark-for-move              |                    |
| mr         | mu4e-view-mark-for-refile            |                    |
| mR         | mu4e-view-mark-for-read              |                    |
| mu         | mu4e-view-mark-for-unread            |                    |
| mU         | mu4e-view-mark-for-unmark            |                    |
| t          | nil                                  | thread             |
| T          | nil                                  | toggle             |
| Tc         | mu4e-view-toggle-hide-cited          |                    |
| Th         | mu4e-view-toggle-html                |                    |
| n          | mu4e-view-headers-next               |                    |
| N          | mu4e-view-headers-next-unread        |                    |
| p          | mu4e-view-headers-prev               |                    |
| P          | mu4e-view-headers-prev-unread        |                    |

Some functions are however lambdas. They all are written as actions on
the current thread. They all begin with ~,t~, and below you can see each
one of the possible following key can act on a thread:
#+name: mu4e-keybindings-view-lambdas-tbl
| Key | Mark thread as |
|-----+----------------|
| td  | trash          |
| tD  | delete         |
| tm  | move           |
| tr  | refile         |
| tR  | read           |
| tu  | unread         |
| tU  | unmark         |

#+name: mu4e-keybindings-view-lambdas-gen
#+header: :tangle no :exports none :results value
#+begin_src emacs-lisp :var table=mu4e-keybindings-view-lambdas-tbl mode="view"
  (mapconcat (lambda (line)
               (let ((key  (car line))
                     (mark (cadr line)))
                 (format "\"%s\" '((lambda ()
             (interactive)
             (mu4e-%s-mark-thread '%s))
         :wk \"Mark as %s\")"
                         key mode mark mark)))
             table
             "\n")
#+end_src

#+RESULTS: mu4e-keybindings-view-lambdas-gen
#+begin_example
"td" '((lambda ()
           (interactive)
           (mu4e-view-mark-thread 'trash))
       :wk "Mark as trash")
"tD" '((lambda ()
           (interactive)
           (mu4e-view-mark-thread 'delete))
       :wk "Mark as delete")
"tm" '((lambda ()
           (interactive)
           (mu4e-view-mark-thread 'move))
       :wk "Mark as move")
"tr" '((lambda ()
           (interactive)
           (mu4e-view-mark-thread 'refile))
       :wk "Mark as refile")
"tR" '((lambda ()
           (interactive)
           (mu4e-view-mark-thread 'read))
       :wk "Mark as read")
"tu" '((lambda ()
           (interactive)
           (mu4e-view-mark-thread 'unread))
       :wk "Mark as unread")
"tU" '((lambda ()
           (interactive)
           (mu4e-view-mark-thread 'unmark))
       :wk "Mark as unmark")
#+end_example

#+name: mu4e-keybindings-view
#+begin_src emacs-lisp :tangle no
  (general-define-key
     :states 'normal
     :keymaps 'mu4e-view-mode-map
     :prefix ","
     <<general-keybindings-gen(table=mu4e-keybindings-view-tbl)>>
     <<mu4e-keybindings-view-lambdas-gen(mode="view")>>)
#+end_src

Some simple keybindings are defined for mu4e’s header mode:
#+name: mu4e-keybindings-headers-tbl
| Key | Function | Description |
|-----+----------+-------------|
| s   | swiper   |             |
| t   | nil      | thread      |

The keybindings from table [[mu4e-keybindings-view-lambdas-tbl]] will also
be reused for this mode.

#+name: mu4e-keybindings-header
#+begin_src emacs-lisp :tangle no
  (general-define-key
     :states 'normal
     :keymaps 'mu4e-headers-mode-map
     :prefix ","
     <<general-keybindings-gen(table=mu4e-keybindings-headers-tbl)>>
     <<mu4e-keybindings-view-lambdas-gen(mode="headers")>>)
#+end_src

#+RESULTS: mu4e-keybindings-header

I will also redefine without a leader key ~ctsr~ in order to be able to
move freely (remember, bépo layout for me).
#+name: mu4e-keybindings-header-no-leader
#+begin_src emacs-lisp :tangle no
  (general-define-key
   :keymaps 'mu4e-headers-mode-map
   :states 'normal
   "c" #'evil-backward-char
   "t" #'evil-next-line
   "s" #'evil-previous-line
   "r" #'evil-forward-char)
#+end_src

#+RESULTS: mu4e-keybindings-header-no-leader

Finally, let’s declare a couple of keybindings for when we are
composing a message. This time, all my keybindings are prefixed with
the major-mode leader and call a simple function.
#+name: mu4e-keybindings-message-tbl
| Key | Function              | Description |
|-----+-----------------------+-------------|
| ,   | message-send-and-exit |             |
| c   | message-send-and-exit |             |
| a   | message-kill-buffer   |             |
| k   | message-kill-buffer   |             |
| s   | message-dont-send     |             |
| f   | mml-attach-file)      |             |

#+name: mu4e-keybindings-message
#+begin_src emacs-lisp :tangle no
  (general-define-key
   :states 'normal
   :keymaps 'message-mode-map
   :prefix ","
   <<general-keybindings-gen(table=mu4e-keybindings-message-tbl)>>
#+end_src

#+RESULTS: mu4e-keybindings-message

